START_TEXT = "Добро пожаловать!  🥳\nЭто не простой бот, а очень грамотный  🤓\n\n" \
             "Чтобы убедиться в этом, выберите режим работы с ботом –– глаголы или существительные  ✍️\n" \
             "После выбора отправьте мне любое существительное или глагол на немецком языке  🇩🇪"

LETTERS_PARS = {"A": "Ä", "a": "ä", "U": "Ü", "u": "ü", "O": "Ö", "o": "ö"}

#add_admin
NOT_ADMIN = "Добавить нового администратора может только администратор. Вы не администратор! 🔴"
CANCELLING = "Вы отменили добавление администратора! 🔴"
INSTRUCTION = "Теперь пришлите Telegram ID пользователя, которого нужно назначить админом! 🤖"

#delete_admin
NOT_ADMIN_DEL = "Разжаловать администратора может только администратор. Вы не администратор! 🔴"
CANCELLING_DEL = "Вы отменили удаление администратора! 🔴"
INSTRUCTION_DEL = "Теперь пришлите Telegram ID пользователя, которого нужно разжаловать 🤖"

#ads_send
INSTRUCTION_SEND = "Теперь пришлите текст рассылки ✏️"
NOT_ADMIN_SEND = "Рассылку может запустить только администратор. Вы не администратор! 🔴"
CONFIRM_INSTRUCTION = "Для продолжения подтвердите свой текст ✏️. Пришлите текст снова, если хотите его изменить" \
                      "\nВаше сообщение будет выглядеть вот так:"

